ace-knu/autosar/mpc5606b/exercises/backup_Base/Generated/Mcal_Output/src/Adc_PBcfg.c
/**
*   @file    Adc_PBcfg.c
*   @version 1.0.1
*
*   @brief   AUTOSAR Adc - Post Build configuration Adc source file.
*   @details Post Build configuration file for Adc driver.
*
*   @addtogroup ADC
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.0 MCAL
*   Platform             : PA
*   Peripheral           : ADCDIG
*   Dependencies         : none
*
*   Autosar Version      : 4.0.3
*   Autosar Revision     : ASR_REL_4_0_REV_0003
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : MPC560xB_MCAL_1_0_1_RTM_ASR_REL_4_0_REV_0003_20140606
*
*   (c) Copyright 2006-2014 Freescale Semiconductor Inc and STMicroelectronics
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Adc_PBcfg_c_REF_1
* Violates MISRA 2004 Advisory Rule 19.1, only preprocessor statements and comments before "#include"
* This violation is not fixed since the inclusion of MemMap.h is as per Autosar requirement.
*
* @section Adc_PBcfg_c_REF_2
* Violates MISRA 2004 Required Rule 19.15, Repeated include file
* This comes from the order of includes in the .c file and from include dependencies. As a safe
* approach, any file must include all its dependencies. Header files are already protected against
* double inclusions.
*
* @section Adc_PBcfg_c_REF_3
* Violates MISRA 2004 Required Rule 8.10, Declaration and definition of objects or function
* Declaration and definition of objects or function at file scope shall have internal linkage unless
* external linkage is required
*
* @section Adc_PBcfg_c_REF_4
* Violates MISRA 2004 Required Rule 5.1, Identifiers shall not more than 31 characters
* Violation is needed because of Autosar restrictions for naming File version check macros.
*
*/

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
/* @implements     DADC00009 */
#include "Adc.h"
/* @violates @ref Adc_PBcfg_c_REF_2 Repeated include file */
#include "Reg_eSys_ADCDig.h"

#ifndef ADC_PRECOMPILE_SUPPORT



/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
* @file           Adc_PBcfg.c
* @implements     DADC04098
*/
#define ADC_PBCFG_C_VENDOR_ID                    (43)
/* @violates @ref Adc_PBcfg_c_REF_4 Identifier exceeds 31 characters */
#define ADC_PBCFG_C_AR_RELEASE_MAJOR_VERSION     (4)
/* @violates @ref Adc_PBcfg_c_REF_4 Identifier exceeds 31 characters */
#define ADC_PBCFG_C_AR_ERLEASE_MINOR_VERSION     (0)
/* @violates @ref Adc_PBcfg_c_REF_4 Identifier exceeds 31 characters */
#define ADC_PBCFG_C_AR_RELEASE_REVISION_VERSION  (3)
#define ADC_PBCFG_C_SW_MAJOR_VERSION             (1)
#define ADC_PBCFG_C_SW_MINOR_VERSION             (0)
#define ADC_PBCFG_C_SW_PATCH_VERSION             (1)

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/
/* @implements     DADC06009 */
/* Check if source file and ADC header file are of the same vendor */
#if (ADC_PBCFG_C_VENDOR_ID != ADC_VENDOR_ID)
    #error "Adc_PBcfg.c and Adc.h have different vendor ids"
#endif

/* Check if source file and ADC header file are of the same Autosar version */
#if ((ADC_PBCFG_C_AR_RELEASE_MAJOR_VERSION != ADC_AR_RELEASE_MAJOR_VERSION) || \
     (ADC_PBCFG_C_AR_ERLEASE_MINOR_VERSION != ADC_AR_RELEASE_MINOR_VERSION) || \
     (ADC_PBCFG_C_AR_RELEASE_REVISION_VERSION != ADC_AR_RELEASE_REVISION_VERSION))
    #error "AutoSar Version Numbers of Adc_PBcfg.c and Adc.h are different"
#endif

/* Check if source file and ADC header file are of the same Software version */
#if ((ADC_PBCFG_C_SW_MAJOR_VERSION != ADC_SW_MAJOR_VERSION) || \
     (ADC_PBCFG_C_SW_MINOR_VERSION != ADC_SW_MINOR_VERSION) || \
     (ADC_PBCFG_C_SW_PATCH_VERSION != ADC_SW_PATCH_VERSION))
    #error "Software Version Numbers of Adc_PBcfg.c and Adc.h are different"
#endif

/* Check if source file and Reg_eSys_ADCDig header file are of the same vendor */
#if (ADC_PBCFG_C_VENDOR_ID != ADC_REG_VENDOR_ID)
    #error "Adc_PBcfg.c and Reg_eSys_ADCDig.h have different vendor ids"
#endif

/* Check if source file and Reg_eSys_ADCDig header file are of the same Autosar version */
#if ((ADC_PBCFG_C_AR_RELEASE_MAJOR_VERSION != ADC_REG_AR_RELEASE_MAJOR_VERSION) || \
     (ADC_PBCFG_C_AR_ERLEASE_MINOR_VERSION != ADC_REG_AR_RELEASE_MINOR_VERSION) || \
     (ADC_PBCFG_C_AR_RELEASE_REVISION_VERSION != ADC_REG_AR_RELEASE_REVISION_VERSION))
    #error "AutoSar Version Numbers of Adc_PBcfg.c and Reg_eSys_ADCDig.h are different"
#endif

/* Check if source file and Reg_eSys_ADCDig header file are of the same Software version */
#if ((ADC_PBCFG_C_SW_MAJOR_VERSION != ADC_REG_SW_MAJOR_VERSION) || \
     (ADC_PBCFG_C_SW_MINOR_VERSION != ADC_REG_SW_MINOR_VERSION) || \
     (ADC_PBCFG_C_SW_PATCH_VERSION != ADC_REG_SW_PATCH_VERSION))
    #error "Software Version Numbers of Adc_PBcfg.c and Reg_eSys_ADCDig.h are different"
#endif

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/
#define ADC_START_SEC_CODE
/* @violates @ref Adc_PBcfg_c_REF_2 Repeated include file */
#include "MemMap.h"


/**
* @brief          ADC Notification functions.
* @details        ADC Nofification functions defined inside the Plugin.
*
* @implements    DADC04099 
*/
/* @violates @ref Adc_PBcfg_c_REF_4 Identifier exceeds 31 characters */
extern void AdcAllGrp0Nf(void); /**< @brief for Group - 32 */

/**
* @brief          Adc Watchdog notification functions.
* @details        Adc Watchdog notification functions defined inside the Plugin.
*
* @implements     DADC04085 
*/

#define ADC_STOP_SEC_CODE
/* @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_PBcfg_c_REF_2 Repeated include file */
#include "MemMap.h"

/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/

/**
* @brief          Total number of groups in Config.
*
* @implements     DADC04086
*/
#define ADC_GROUPS_1  33

/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/
/* @violates @ref Adc_PBcfg_c_REF_4 Identifier exceeds 31 characters */
#define ADC_START_SEC_VAR_INIT_UNSPECIFIED
/* @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_PBcfg_c_REF_2 Repeated include file */
#include "MemMap.h"

/**
* @brief          Adc Result Buffer RAM initializations.
* @details        Array for all ADC group result ram buffers.
*
* @implements     DADC04087
*/
STATIC P2VAR(Adc_ValueGroupType, ADC_VAR, ADC_APPL_DATA) ADC_ResultsBufferPtr[] =
{
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR,
 NULL_PTR
};

/* @violates @ref Adc_PBcfg_c_REF_4 Identifier exceeds 31 characters */
#define ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/* @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_PBcfg_c_REF_2 Repeated include file */
#include "MemMap.h"

/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/

/* @violates @ref Adc_PBcfg_c_REF_4 Identifier exceeds 31 characters */
#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
/* @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_PBcfg_c_REF_2 Repeated include file */
#include "MemMap.h"


/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group32_Assignment_PB_0_1[ADC_CFGSET1_GROUP_32_CHANNELS] =
{
 0U,
 1U,
 2U,
 3U,
 4U,
 5U,
 6U,
 7U,
 8U,
 9U,
 10U,
 11U,
 12U,
 13U,
 14U,
 15U,
 16U,
 17U,
 18U,
 19U,
 20U,
 21U,
 22U,
 23U,
 24U,
 25U,
 26U,
 27U,
 28U,
 29U,
 30U,
 31U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group0_Assignment_PB_0_1[ADC_CFGSET1_GROUP_0_CHANNELS] =
{
 0U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group1_Assignment_PB_0_1[ADC_CFGSET1_GROUP_1_CHANNELS] =
{
 1U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group2_Assignment_PB_0_1[ADC_CFGSET1_GROUP_2_CHANNELS] =
{
 2U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group3_Assignment_PB_0_1[ADC_CFGSET1_GROUP_3_CHANNELS] =
{
 3U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group4_Assignment_PB_0_1[ADC_CFGSET1_GROUP_4_CHANNELS] =
{
 4U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group5_Assignment_PB_0_1[ADC_CFGSET1_GROUP_5_CHANNELS] =
{
 5U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group6_Assignment_PB_0_1[ADC_CFGSET1_GROUP_6_CHANNELS] =
{
 6U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group7_Assignment_PB_0_1[ADC_CFGSET1_GROUP_7_CHANNELS] =
{
 7U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group8_Assignment_PB_0_1[ADC_CFGSET1_GROUP_8_CHANNELS] =
{
 8U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group9_Assignment_PB_0_1[ADC_CFGSET1_GROUP_9_CHANNELS] =
{
 9U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group10_Assignment_PB_0_1[ADC_CFGSET1_GROUP_10_CHANNELS] =
{
 10U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group11_Assignment_PB_0_1[ADC_CFGSET1_GROUP_11_CHANNELS] =
{
 11U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group12_Assignment_PB_0_1[ADC_CFGSET1_GROUP_12_CHANNELS] =
{
 12U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group13_Assignment_PB_0_1[ADC_CFGSET1_GROUP_13_CHANNELS] =
{
 13U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group14_Assignment_PB_0_1[ADC_CFGSET1_GROUP_14_CHANNELS] =
{
 14U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group15_Assignment_PB_0_1[ADC_CFGSET1_GROUP_15_CHANNELS] =
{
 15U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group16_Assignment_PB_0_1[ADC_CFGSET1_GROUP_16_CHANNELS] =
{
 16U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group17_Assignment_PB_0_1[ADC_CFGSET1_GROUP_17_CHANNELS] =
{
 17U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group18_Assignment_PB_0_1[ADC_CFGSET1_GROUP_18_CHANNELS] =
{
 18U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group19_Assignment_PB_0_1[ADC_CFGSET1_GROUP_19_CHANNELS] =
{
 19U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group20_Assignment_PB_0_1[ADC_CFGSET1_GROUP_20_CHANNELS] =
{
 20U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group21_Assignment_PB_0_1[ADC_CFGSET1_GROUP_21_CHANNELS] =
{
 21U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group22_Assignment_PB_0_1[ADC_CFGSET1_GROUP_22_CHANNELS] =
{
 22U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group23_Assignment_PB_0_1[ADC_CFGSET1_GROUP_23_CHANNELS] =
{
 23U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group24_Assignment_PB_0_1[ADC_CFGSET1_GROUP_24_CHANNELS] =
{
 24U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group25_Assignment_PB_0_1[ADC_CFGSET1_GROUP_25_CHANNELS] =
{
 25U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group26_Assignment_PB_0_1[ADC_CFGSET1_GROUP_26_CHANNELS] =
{
 26U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group27_Assignment_PB_0_1[ADC_CFGSET1_GROUP_27_CHANNELS] =
{
 27U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group28_Assignment_PB_0_1[ADC_CFGSET1_GROUP_28_CHANNELS] =
{
 28U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group29_Assignment_PB_0_1[ADC_CFGSET1_GROUP_29_CHANNELS] =
{
 29U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group30_Assignment_PB_0_1[ADC_CFGSET1_GROUP_30_CHANNELS] =
{
 30U
};
/**
* @brief          Group Assignments on ADC Hardware unit 0 - Configuration 1.
* @implements     DADC04089
*/
STATIC CONST(Adc_ChannelType, ADC_CONST) ADC_Group31_Assignment_PB_0_1[ADC_CFGSET1_GROUP_31_CHANNELS] =
{
 31U
};




/**
* @brief          Definition of Hw units Configuration 1.
* @implements     DADC04091
*/
STATIC CONST(Adc_LLD_HWUnitConfiguration, ADC_CONST) Adc_HWUnit_CfgPB_1[] =
{
  /**< @brief Hardware Unit ADC_UNIT_0 */
  {
    /**< @brief Hardware unit id */
    (Adc_HwUnitType)ADC_UNIT_0,
    /**< @brief Main configuration for control register */
    (ADC_CLOCK_PRESCALER_DIV2 | ADC_AUTO_CLKOFF_DIS | ADC_OVERWRITE_EN | ADC_WRITE_RIGHT_ALIGNED),
    /**< @brief Power down exit delay when ADC runs on normal system frequency */
    (ADC_POWERDOWN_EXIT_DELAY_VALUE(15)),
    /**< @brief Mux delay value */
    /**< @brief DC_PRESAMP_VOLTAGE_V0 -> Vss=0V */
    (uint8)0x0,
    /**< @brief do not bypass the sampling phase */
    (uint8)0x0,
    (Adc_ConversionTimeType)0x0,
    (Adc_ConversionTimeType)0x0,
    /**< @brief Bit resolution */
    (Adc_ResolutionType)ADC_BITS_RESOLUTION_10
  }
};


