ace-knu/autosar/mpc5606b/exercises/backup_Base/Generated/Mcal_Output/src/Adc_PBcfg.c
/**
* @brief          Definition of channels on ADC Hardware unit 0 - Configuration 1.
* @details         array of conversion command messages
* @implements     DADC04092
*/
STATIC CONST(Adc_LLD_ChannelConfiguration, ADC_CONST) Adc_Channels_CfgPB_0_1[] =
{
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_0 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(0)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_1 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(1)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_2 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(2)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_3 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(3)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_4 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(4)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_5 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(5)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_6 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(6)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_7 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(7)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_8 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(8)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_9 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(9)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_10 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(10)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_11 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(11)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_12 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(12)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_13 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(13)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_14 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(14)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANP_15 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(15)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_0 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(32)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_1 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(33)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_2 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(34)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_3 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(35)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_4 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(36)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_5 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(37)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_6 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(38)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_7 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(39)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_8 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(40)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_9 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(41)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_10 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(42)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_11 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(43)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_12 */
  {
    /**< @brief Adc physical channel */
