ace-knu/autosar/mpc5606b/exercises/backup_Base/Generated/Mcal_Output/src/Adc_PBcfg.c
    (Adc_ChannelType)(ADC_ID_CHANNEL(44)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_13 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(45)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_14 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(46)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  },
  /**< @brief Hardware Unit ADC_UNIT_0  --  ANS_15 */
  {
    /**< @brief Adc physical channel */
    (Adc_ChannelType)(ADC_ID_CHANNEL(47)),
        /**< @brief Threshold register configured */
    ADC_THRESHOLD_REG_0,
    /**< @brief Threshold register value */
    ADC_UNUSED_THRESHOLD,
    /**< @brief Threshold control register value */
    ADC_TH_DISABLE,
    /**< @brief No WDOG notification */
    NULL_PTR,
    /**< @brief presampling disabled */
    (uint8)0x0
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    ,
    /**< @brief limit check disabled */
    (boolean)FALSE,
    /**< @brief range for limit check */
    (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
    /**< @brief high limit value */
    (uint32)0,
    /**< @brief low limit value */
    (uint32)0
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
  }
};


/**
* @brief          Definition of channel's pointer structure for configuration 1.
* @implements     DADC04094
*/
STATIC P2CONST(Adc_LLD_ChannelConfiguration, ADC_VAR, ADC_APPL_CONST) Adc_Channels_CfgPB_1[] =
{
  Adc_Channels_CfgPB_0_1,
  NULL_PTR
};

/**
* @brief          Definition of groups for configuration 1.
* @implements     DADC04096
*/
STATIC CONST(Adc_LLD_GroupConfiguration, ADC_CONST) Adc_Groups_CfgPB_1[] =
{


  /**< @brief Group0 -- Hardware Unit ADC_UNIT_0 */
  {
    /**< @brief Hardware unit configured */
    (Adc_HwUnitType)ADC_UNIT_0,
    /**< @brief Access mode */
    ADC_ACCESS_MODE_SINGLE,
    /**< @brief Conversion mode */
    ADC_CONV_MODE_ONESHOT,
    /**< @brief Conversion type */
    ADC_CONV_TYPE_NORMAL,
    #if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /**< @brief Priority configured */
    ADC_GROUP_PRIORITY(0U),
    #endif
    /**< @brief Replacement mode */
    ADC_GROUP_REPL_ABORT_RESTART,
    /**< @brief Trigger source configured */
    ADC_TRIGG_SRC_SW,
    #if (STD_ON==ADC_HW_TRIGGER_API)
    #if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)
        /**< @brief This a Regular Group */
    (Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE,
        #endif /* (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS) */
    /**< @brief Hardware trigger signal */
    ADC_HW_TRIG_BOTH_EDGES,
    /**< @brief Number of hardware trigger sources */
    0U,
    /**< @brief Hardware resource for the group*/
    0U,
    #endif /* (STD_ON==ADC_HW_TRIGGER_API) */
    #if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
    /**< @brief Notification function */
        NULL_PTR,
        #endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
    /**< @brief Precision configured channels */
    (uint32)0x1U,
    /**< @brief Extended configured channels */
    (uint32)0x0U,
    /**< @brief External configured channels */
    (uint32)0x0U,
    /**< @brief Presampling for Precision channels */
    (uint32)0x0U,
    /**< @brief Presampling for Extended channels */
    (uint32)0x0U,
    /**< @brief Presampling for External channels */
    (uint32)0x0U,
    /**< @brief Wer0 for precision channels */
    (uint32)0x0U,
    /**< @brief Wer1 for extended(medi.accuracy channels) */
    (uint32)0x0U,
    /**< @brief Wer2 for external channels */
    (uint32)0x0U,
    /**< @brief ADC Group Result Buffers RAM array */
    ADC_ResultsBufferPtr,
    /**< @brief Group Streaming Buffer Mode */
    ADC_STREAM_BUFFER_LINEAR,
    #if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /**< @brief Index of the group with AdcEnableChDisableChGroup enabled */
    (Adc_GroupType)ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX,
    #endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    /**< @brief Number of streaming samples */
    ADC_STREAMING_NUM_SAMPLES(1),
    /**< @brief Channels assigned to the group*/
    ADC_Group0_Assignment_PB_0_1,
    /**< @brief Number of channels in the group*/
    (Adc_ChannelType)ADC_CFGSET1_GROUP_0_CHANNELS,
    /**< @brief Conversion time */
    (ADC_INPLATCH_VALUE(ADC_ONE_CLOCK_CYCLE)|ADC_INPCMP_VALUE(ADC_THREE_LATCH_CYCLE)|ADC_INPSAMP_VALUE(3)),
    /**< @brief Last Channel configured */
    (uint32)(0),
    /**< @brief First Channel Configured */
    (ADC_ID_CHANNEL(0)<<(uint32)2),
    /**< @brief Enables or Disables the ADC and DMA interrupts */
    (uint8)STD_ON
  },


