ace-knu/autosar/mpc5606b/exercises/backup_Base/Generated/Mcal_Output/src/Adc_PBcfg.c
  /**< @brief Group22 -- Hardware Unit ADC_UNIT_0 */
  {
    /**< @brief Hardware unit configured */
    (Adc_HwUnitType)ADC_UNIT_0,
    /**< @brief Access mode */
    ADC_ACCESS_MODE_SINGLE,
    /**< @brief Conversion mode */
    ADC_CONV_MODE_ONESHOT,
    /**< @brief Conversion type */
    ADC_CONV_TYPE_NORMAL,
    #if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /**< @brief Priority configured */
    ADC_GROUP_PRIORITY(0U),
    #endif
    /**< @brief Replacement mode */
    ADC_GROUP_REPL_ABORT_RESTART,
    /**< @brief Trigger source configured */
    ADC_TRIGG_SRC_SW,
    #if (STD_ON==ADC_HW_TRIGGER_API)
    #if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)
        /**< @brief This a Regular Group */
    (Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE,
        #endif /* (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS) */
    /**< @brief Hardware trigger signal */
    ADC_HW_TRIG_BOTH_EDGES,
    /**< @brief Number of hardware trigger sources */
    0U,
    /**< @brief Hardware resource for the group*/
    0U,
    #endif /* (STD_ON==ADC_HW_TRIGGER_API) */
    #if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
    /**< @brief Notification function */
        NULL_PTR,
        #endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
    /**< @brief Precision configured channels */
    (uint32)0x0U,
    /**< @brief Extended configured channels */
    (uint32)0x40U,
    /**< @brief External configured channels */
    (uint32)0x0U,
    /**< @brief Presampling for Precision channels */
    (uint32)0x0U,
    /**< @brief Presampling for Extended channels */
    (uint32)0x0U,
    /**< @brief Presampling for External channels */
    (uint32)0x0U,
    /**< @brief Wer0 for precision channels */
    (uint32)0x0U,
    /**< @brief Wer1 for extended(medi.accuracy channels) */
    (uint32)0x0U,
    /**< @brief Wer2 for external channels */
    (uint32)0x0U,
    /**< @brief ADC Group Result Buffers RAM array */
    ADC_ResultsBufferPtr,
    /**< @brief Group Streaming Buffer Mode */
    ADC_STREAM_BUFFER_LINEAR,
    #if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /**< @brief Index of the group with AdcEnableChDisableChGroup enabled */
    (Adc_GroupType)ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX,
    #endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    /**< @brief Number of streaming samples */
    ADC_STREAMING_NUM_SAMPLES(1),
    /**< @brief Channels assigned to the group*/
    ADC_Group22_Assignment_PB_0_1,
    /**< @brief Number of channels in the group*/
    (Adc_ChannelType)ADC_CFGSET1_GROUP_22_CHANNELS,
    /**< @brief Conversion time */
    (ADC_INPLATCH_VALUE(ADC_HALF_CLOCK_CYCLE)|ADC_INPCMP_VALUE(ADC_TWO_LATCH_CYCLE)|ADC_INPSAMP_VALUE(3)),
    /**< @brief Last Channel configured */
    (uint32)(38),
    /**< @brief First Channel Configured */
    (ADC_ID_CHANNEL(38)<<(uint32)2),
    /**< @brief Enables or Disables the ADC and DMA interrupts */
    (uint8)STD_ON
  },


  /**< @brief Group23 -- Hardware Unit ADC_UNIT_0 */
  {
    /**< @brief Hardware unit configured */
    (Adc_HwUnitType)ADC_UNIT_0,
    /**< @brief Access mode */
    ADC_ACCESS_MODE_SINGLE,
    /**< @brief Conversion mode */
    ADC_CONV_MODE_ONESHOT,
    /**< @brief Conversion type */
    ADC_CONV_TYPE_NORMAL,
    #if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /**< @brief Priority configured */
    ADC_GROUP_PRIORITY(0U),
    #endif
    /**< @brief Replacement mode */
    ADC_GROUP_REPL_ABORT_RESTART,
    /**< @brief Trigger source configured */
    ADC_TRIGG_SRC_SW,
    #if (STD_ON==ADC_HW_TRIGGER_API)
    #if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)
        /**< @brief This a Regular Group */
    (Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE,
        #endif /* (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS) */
    /**< @brief Hardware trigger signal */
    ADC_HW_TRIG_BOTH_EDGES,
    /**< @brief Number of hardware trigger sources */
    0U,
    /**< @brief Hardware resource for the group*/
    0U,
    #endif /* (STD_ON==ADC_HW_TRIGGER_API) */
    #if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
    /**< @brief Notification function */
        NULL_PTR,
        #endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
    /**< @brief Precision configured channels */
    (uint32)0x0U,
    /**< @brief Extended configured channels */
    (uint32)0x80U,
    /**< @brief External configured channels */
    (uint32)0x0U,
    /**< @brief Presampling for Precision channels */
    (uint32)0x0U,
    /**< @brief Presampling for Extended channels */
    (uint32)0x0U,
    /**< @brief Presampling for External channels */
    (uint32)0x0U,
    /**< @brief Wer0 for precision channels */
    (uint32)0x0U,
    /**< @brief Wer1 for extended(medi.accuracy channels) */
    (uint32)0x0U,
    /**< @brief Wer2 for external channels */
    (uint32)0x0U,
    /**< @brief ADC Group Result Buffers RAM array */
    ADC_ResultsBufferPtr,
    /**< @brief Group Streaming Buffer Mode */
    ADC_STREAM_BUFFER_LINEAR,
    #if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /**< @brief Index of the group with AdcEnableChDisableChGroup enabled */
    (Adc_GroupType)ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX,
    #endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    /**< @brief Number of streaming samples */
    ADC_STREAMING_NUM_SAMPLES(1),
    /**< @brief Channels assigned to the group*/
    ADC_Group23_Assignment_PB_0_1,
    /**< @brief Number of channels in the group*/
    (Adc_ChannelType)ADC_CFGSET1_GROUP_23_CHANNELS,
    /**< @brief Conversion time */
    (ADC_INPLATCH_VALUE(ADC_HALF_CLOCK_CYCLE)|ADC_INPCMP_VALUE(ADC_TWO_LATCH_CYCLE)|ADC_INPSAMP_VALUE(3)),
    /**< @brief Last Channel configured */
    (uint32)(39),
    /**< @brief First Channel Configured */
    (ADC_ID_CHANNEL(39)<<(uint32)2),
    /**< @brief Enables or Disables the ADC and DMA interrupts */
    (uint8)STD_ON
  },


  /**< @brief Group24 -- Hardware Unit ADC_UNIT_0 */
  {
    /**< @brief Hardware unit configured */
    (Adc_HwUnitType)ADC_UNIT_0,
    /**< @brief Access mode */
    ADC_ACCESS_MODE_SINGLE,
    /**< @brief Conversion mode */
    ADC_CONV_MODE_ONESHOT,
    /**< @brief Conversion type */
    ADC_CONV_TYPE_NORMAL,
    #if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /**< @brief Priority configured */
    ADC_GROUP_PRIORITY(0U),
    #endif
    /**< @brief Replacement mode */
    ADC_GROUP_REPL_ABORT_RESTART,
    /**< @brief Trigger source configured */
    ADC_TRIGG_SRC_SW,
    #if (STD_ON==ADC_HW_TRIGGER_API)
    #if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)
        /**< @brief This a Regular Group */
    (Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE,
        #endif /* (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS) */
    /**< @brief Hardware trigger signal */
    ADC_HW_TRIG_BOTH_EDGES,
    /**< @brief Number of hardware trigger sources */
    0U,
    /**< @brief Hardware resource for the group*/
    0U,
    #endif /* (STD_ON==ADC_HW_TRIGGER_API) */
    #if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
    /**< @brief Notification function */
        NULL_PTR,
        #endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
    /**< @brief Precision configured channels */
    (uint32)0x0U,
    /**< @brief Extended configured channels */
    (uint32)0x100U,
    /**< @brief External configured channels */
    (uint32)0x0U,
    /**< @brief Presampling for Precision channels */
    (uint32)0x0U,
    /**< @brief Presampling for Extended channels */
    (uint32)0x0U,
    /**< @brief Presampling for External channels */
    (uint32)0x0U,
    /**< @brief Wer0 for precision channels */
    (uint32)0x0U,
    /**< @brief Wer1 for extended(medi.accuracy channels) */
    (uint32)0x0U,
    /**< @brief Wer2 for external channels */
    (uint32)0x0U,
    /**< @brief ADC Group Result Buffers RAM array */
    ADC_ResultsBufferPtr,
    /**< @brief Group Streaming Buffer Mode */
    ADC_STREAM_BUFFER_LINEAR,
    #if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /**< @brief Index of the group with AdcEnableChDisableChGroup enabled */
    (Adc_GroupType)ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX,
    #endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    /**< @brief Number of streaming samples */
    ADC_STREAMING_NUM_SAMPLES(1),
    /**< @brief Channels assigned to the group*/
    ADC_Group24_Assignment_PB_0_1,
    /**< @brief Number of channels in the group*/
    (Adc_ChannelType)ADC_CFGSET1_GROUP_24_CHANNELS,
    /**< @brief Conversion time */
    (ADC_INPLATCH_VALUE(ADC_HALF_CLOCK_CYCLE)|ADC_INPCMP_VALUE(ADC_TWO_LATCH_CYCLE)|ADC_INPSAMP_VALUE(3)),
    /**< @brief Last Channel configured */
    (uint32)(40),
    /**< @brief First Channel Configured */
    (ADC_ID_CHANNEL(40)<<(uint32)2),
    /**< @brief Enables or Disables the ADC and DMA interrupts */
    (uint8)STD_ON
  },


  /**< @brief Group25 -- Hardware Unit ADC_UNIT_0 */
  {
    /**< @brief Hardware unit configured */
    (Adc_HwUnitType)ADC_UNIT_0,
    /**< @brief Access mode */
    ADC_ACCESS_MODE_SINGLE,
    /**< @brief Conversion mode */
    ADC_CONV_MODE_ONESHOT,
    /**< @brief Conversion type */
    ADC_CONV_TYPE_NORMAL,
    #if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /**< @brief Priority configured */
    ADC_GROUP_PRIORITY(0U),
    #endif
    /**< @brief Replacement mode */
    ADC_GROUP_REPL_ABORT_RESTART,
    /**< @brief Trigger source configured */
    ADC_TRIGG_SRC_SW,
    #if (STD_ON==ADC_HW_TRIGGER_API)
    #if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)
        /**< @brief This a Regular Group */
    (Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE,
        #endif /* (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS) */
    /**< @brief Hardware trigger signal */
    ADC_HW_TRIG_BOTH_EDGES,
    /**< @brief Number of hardware trigger sources */
    0U,
    /**< @brief Hardware resource for the group*/
    0U,
    #endif /* (STD_ON==ADC_HW_TRIGGER_API) */
    #if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
    /**< @brief Notification function */
        NULL_PTR,
        #endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
    /**< @brief Precision configured channels */
    (uint32)0x0U,
    /**< @brief Extended configured channels */
    (uint32)0x200U,
    /**< @brief External configured channels */
    (uint32)0x0U,
    /**< @brief Presampling for Precision channels */
    (uint32)0x0U,
    /**< @brief Presampling for Extended channels */
    (uint32)0x0U,
    /**< @brief Presampling for External channels */
    (uint32)0x0U,
    /**< @brief Wer0 for precision channels */
    (uint32)0x0U,
    /**< @brief Wer1 for extended(medi.accuracy channels) */
    (uint32)0x0U,
    /**< @brief Wer2 for external channels */
    (uint32)0x0U,
    /**< @brief ADC Group Result Buffers RAM array */
    ADC_ResultsBufferPtr,
    /**< @brief Group Streaming Buffer Mode */
    ADC_STREAM_BUFFER_LINEAR,
    #if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /**< @brief Index of the group with AdcEnableChDisableChGroup enabled */
    (Adc_GroupType)ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX,
    #endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    /**< @brief Number of streaming samples */
    ADC_STREAMING_NUM_SAMPLES(1),
    /**< @brief Channels assigned to the group*/
    ADC_Group25_Assignment_PB_0_1,
    /**< @brief Number of channels in the group*/
    (Adc_ChannelType)ADC_CFGSET1_GROUP_25_CHANNELS,
    /**< @brief Conversion time */
    (ADC_INPLATCH_VALUE(ADC_HALF_CLOCK_CYCLE)|ADC_INPCMP_VALUE(ADC_TWO_LATCH_CYCLE)|ADC_INPSAMP_VALUE(3)),
    /**< @brief Last Channel configured */
    (uint32)(41),
    /**< @brief First Channel Configured */
    (ADC_ID_CHANNEL(41)<<(uint32)2),
    /**< @brief Enables or Disables the ADC and DMA interrupts */
    (uint8)STD_ON
  },


  /**< @brief Group26 -- Hardware Unit ADC_UNIT_0 */
  {
    /**< @brief Hardware unit configured */
    (Adc_HwUnitType)ADC_UNIT_0,
    /**< @brief Access mode */
    ADC_ACCESS_MODE_SINGLE,
    /**< @brief Conversion mode */
    ADC_CONV_MODE_ONESHOT,
    /**< @brief Conversion type */
    ADC_CONV_TYPE_NORMAL,
    #if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /**< @brief Priority configured */
    ADC_GROUP_PRIORITY(0U),
    #endif
    /**< @brief Replacement mode */
    ADC_GROUP_REPL_ABORT_RESTART,
    /**< @brief Trigger source configured */
    ADC_TRIGG_SRC_SW,
    #if (STD_ON==ADC_HW_TRIGGER_API)
    #if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)
        /**< @brief This a Regular Group */
    (Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE,
        #endif /* (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS) */
    /**< @brief Hardware trigger signal */
    ADC_HW_TRIG_BOTH_EDGES,
    /**< @brief Number of hardware trigger sources */
    0U,
    /**< @brief Hardware resource for the group*/
    0U,
    #endif /* (STD_ON==ADC_HW_TRIGGER_API) */
    #if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
    /**< @brief Notification function */
        NULL_PTR,
        #endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
    /**< @brief Precision configured channels */
    (uint32)0x0U,
    /**< @brief Extended configured channels */
    (uint32)0x400U,
    /**< @brief External configured channels */
    (uint32)0x0U,
    /**< @brief Presampling for Precision channels */
    (uint32)0x0U,
    /**< @brief Presampling for Extended channels */
    (uint32)0x0U,
    /**< @brief Presampling for External channels */
    (uint32)0x0U,
    /**< @brief Wer0 for precision channels */
    (uint32)0x0U,
    /**< @brief Wer1 for extended(medi.accuracy channels) */
    (uint32)0x0U,
    /**< @brief Wer2 for external channels */
    (uint32)0x0U,
    /**< @brief ADC Group Result Buffers RAM array */
    ADC_ResultsBufferPtr,
    /**< @brief Group Streaming Buffer Mode */
    ADC_STREAM_BUFFER_LINEAR,
    #if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /**< @brief Index of the group with AdcEnableChDisableChGroup enabled */
    (Adc_GroupType)ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX,
    #endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    /**< @brief Number of streaming samples */
    ADC_STREAMING_NUM_SAMPLES(1),
    /**< @brief Channels assigned to the group*/
    ADC_Group26_Assignment_PB_0_1,
    /**< @brief Number of channels in the group*/
    (Adc_ChannelType)ADC_CFGSET1_GROUP_26_CHANNELS,
    /**< @brief Conversion time */
    (ADC_INPLATCH_VALUE(ADC_HALF_CLOCK_CYCLE)|ADC_INPCMP_VALUE(ADC_TWO_LATCH_CYCLE)|ADC_INPSAMP_VALUE(3)),
    /**< @brief Last Channel configured */
    (uint32)(42),
    /**< @brief First Channel Configured */
    (ADC_ID_CHANNEL(42)<<(uint32)2),
    /**< @brief Enables or Disables the ADC and DMA interrupts */
    (uint8)STD_ON
  },


