ace-knu/autosar/mpc5606b/exercises/backup_Base/Generated/Mcal_Output/src/Adc_PBcfg.c
  /**< @brief Group31 -- Hardware Unit ADC_UNIT_0 */
  {
    /**< @brief Hardware unit configured */
    (Adc_HwUnitType)ADC_UNIT_0,
    /**< @brief Access mode */
    ADC_ACCESS_MODE_SINGLE,
    /**< @brief Conversion mode */
    ADC_CONV_MODE_ONESHOT,
    /**< @brief Conversion type */
    ADC_CONV_TYPE_NORMAL,
    #if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /**< @brief Priority configured */
    ADC_GROUP_PRIORITY(0U),
    #endif
    /**< @brief Replacement mode */
    ADC_GROUP_REPL_ABORT_RESTART,
    /**< @brief Trigger source configured */
    ADC_TRIGG_SRC_SW,
    #if (STD_ON==ADC_HW_TRIGGER_API)
    #if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)
        /**< @brief This a Regular Group */
    (Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE,
        #endif /* (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS) */
    /**< @brief Hardware trigger signal */
    ADC_HW_TRIG_BOTH_EDGES,
    /**< @brief Number of hardware trigger sources */
    0U,
    /**< @brief Hardware resource for the group*/
    0U,
    #endif /* (STD_ON==ADC_HW_TRIGGER_API) */
    #if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
    /**< @brief Notification function */
        NULL_PTR,
        #endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
    /**< @brief Precision configured channels */
    (uint32)0x0U,
    /**< @brief Extended configured channels */
    (uint32)0x8000U,
    /**< @brief External configured channels */
    (uint32)0x0U,
    /**< @brief Presampling for Precision channels */
    (uint32)0x0U,
    /**< @brief Presampling for Extended channels */
    (uint32)0x0U,
    /**< @brief Presampling for External channels */
    (uint32)0x0U,
    /**< @brief Wer0 for precision channels */
    (uint32)0x0U,
    /**< @brief Wer1 for extended(medi.accuracy channels) */
    (uint32)0x0U,
    /**< @brief Wer2 for external channels */
    (uint32)0x0U,
    /**< @brief ADC Group Result Buffers RAM array */
    ADC_ResultsBufferPtr,
    /**< @brief Group Streaming Buffer Mode */
    ADC_STREAM_BUFFER_LINEAR,
    #if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /**< @brief Index of the group with AdcEnableChDisableChGroup enabled */
    (Adc_GroupType)ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX,
    #endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    /**< @brief Number of streaming samples */
    ADC_STREAMING_NUM_SAMPLES(1),
    /**< @brief Channels assigned to the group*/
    ADC_Group31_Assignment_PB_0_1,
    /**< @brief Number of channels in the group*/
    (Adc_ChannelType)ADC_CFGSET1_GROUP_31_CHANNELS,
    /**< @brief Conversion time */
    (ADC_INPLATCH_VALUE(ADC_HALF_CLOCK_CYCLE)|ADC_INPCMP_VALUE(ADC_TWO_LATCH_CYCLE)|ADC_INPSAMP_VALUE(3)),
    /**< @brief Last Channel configured */
    (uint32)(47),
    /**< @brief First Channel Configured */
    (ADC_ID_CHANNEL(47)<<(uint32)2),
    /**< @brief Enables or Disables the ADC and DMA interrupts */
    (uint8)STD_ON
  },


  /**< @brief Group32 -- Hardware Unit ADC_UNIT_0 */
  {
    /**< @brief Hardware unit configured */
    (Adc_HwUnitType)ADC_UNIT_0,
    /**< @brief Access mode */
    ADC_ACCESS_MODE_SINGLE,
    /**< @brief Conversion mode */
    ADC_CONV_MODE_ONESHOT,
    /**< @brief Conversion type */
    ADC_CONV_TYPE_NORMAL,
    #if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /**< @brief Priority configured */
    ADC_GROUP_PRIORITY(0U),
    #endif
    /**< @brief Replacement mode */
    ADC_GROUP_REPL_ABORT_RESTART,
    /**< @brief Trigger source configured */
    ADC_TRIGG_SRC_SW,
    #if (STD_ON==ADC_HW_TRIGGER_API)
    #if (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS)
        /**< @brief This a Regular Group */
    (Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE,
        #endif /* (STD_ON == ADC_MULTIPLE_HARDWARE_TRIGGERS) */
    /**< @brief Hardware trigger signal */
    ADC_HW_TRIG_BOTH_EDGES,
    /**< @brief Number of hardware trigger sources */
    0U,
    /**< @brief Hardware resource for the group*/
    0U,
    #endif /* (STD_ON==ADC_HW_TRIGGER_API) */
    #if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
    /**< @brief Notification function */
        &AdcAllGrp0Nf,
        #endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
    /**< @brief Precision configured channels */
    (uint32)0xffffU,
    /**< @brief Extended configured channels */
    (uint32)0xffffU,
    /**< @brief External configured channels */
    (uint32)0x0U,
    /**< @brief Presampling for Precision channels */
    (uint32)0x0U,
    /**< @brief Presampling for Extended channels */
    (uint32)0x0U,
    /**< @brief Presampling for External channels */
    (uint32)0x0U,
    /**< @brief Wer0 for precision channels */
    (uint32)0x0U,
    /**< @brief Wer1 for extended(medi.accuracy channels) */
    (uint32)0x0U,
    /**< @brief Wer2 for external channels */
    (uint32)0x0U,
    /**< @brief ADC Group Result Buffers RAM array */
    ADC_ResultsBufferPtr,
    /**< @brief Group Streaming Buffer Mode */
    ADC_STREAM_BUFFER_LINEAR,
    #if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    /**< @brief Index of the group with AdcEnableChDisableChGroup enabled */
    (Adc_GroupType)ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX,
    #endif /* (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) */
    /**< @brief Number of streaming samples */
    ADC_STREAMING_NUM_SAMPLES(1),
    /**< @brief Channels assigned to the group*/
    ADC_Group32_Assignment_PB_0_1,
    /**< @brief Number of channels in the group*/
    (Adc_ChannelType)ADC_CFGSET1_GROUP_32_CHANNELS,
    /**< @brief Conversion time */
    (ADC_INPLATCH_VALUE(ADC_HALF_CLOCK_CYCLE)|ADC_INPCMP_VALUE(ADC_TWO_LATCH_CYCLE)|ADC_INPSAMP_VALUE(3)),
    /**< @brief Last Channel configured */
    (uint32)(15),
    /**< @brief First Channel Configured */
    (ADC_ID_CHANNEL(0)<<(uint32)2),
    /**< @brief Enables or Disables the ADC and DMA interrupts */
    (uint8)STD_OFF
  }
};

/* @violates @ref Adc_PBcfg_c_REF_4 Identifier exceeds 31 characters */
#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/* @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_PBcfg_c_REF_2 Repeated include file */
#include "MemMap.h"

/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/
/* @violates @ref Adc_PBcfg_c_REF_4 Identifier exceeds 31 characters */
#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
/* @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_PBcfg_c_REF_2 Repeated include file */
#include "MemMap.h"


#if (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_ON)
/**
* @brief         Values for production code Event Ids.
* @details       ADC production code Event Ids.
*
* @implements    DADC04106
*/
CONST(Mcal_DemErrorType,ADC_CONST)Adc_E_TimeoutCfg = { (uint32)STD_ON, (uint32)1U}; /* ADC_E_TIMEOUT parameters*/

#endif /* ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_ON */

/**
* @brief          Configuration structure 1.
* @implements     DADC04097
*/
/* @violates @ref Adc_PBcfg_c_REF_3 Declaration and definition of objects or function */
CONST(Adc_ConfigType, ADC_CONST) AdcConfigSet_0 =
{
    /**< @brief pointer to Hw unit configurations */
    Adc_HWUnit_CfgPB_1,
    /**< @brief pointer to group configurations */
    Adc_Groups_CfgPB_1,
    /**< @brief pointer to channel configurations */
    Adc_Channels_CfgPB_1,
    /**< @brief total number of groups */
    (Adc_GroupType)ADC_GROUPS_1,
    /**< @brief Miscellaneous configuration parameters. - Adc_LLD_MultiConfig */
    {
      /**< @brief Interrupt driven Mode */
    ADC_INTERRUPT,
      /**< @brief ADC is CTUV2 driven or not */
    (uint8)STD_OFF,
    /**< @brief number of the maximum groups in the current configuration */
    33U,
    /**< @brief number of the maximum hardware units in the current configuration */
    1U,
    /**< @brief depth of the queue */
    1U,
       {      /**< @brief number of groups of the hw unit 0 */
      (uint8)33,
      /**< @brief number of groups of the hw unit 1 */
      (uint8)0

