ace-knu/autosar/mpc5606b/exercises/backup_Base/Generated/Mcal_Output/src/Adc_PBcfg.c
    },    {
      /**< @brief number of channels of the ADC Hardware unit 0 */
      (uint8)32,
      /**< @brief number of channels of the ADC Hardware unit 1 */
      (uint8)0 
    },
    {            /**< @brief the DMA channel number for both ADC Hardware units */
      (uint8)0,
            (uint8)0
                },
    {
      /**< @brief ADC_UNIT_0 - ON/OFF */
      (uint8)STD_ON,
              /**< @brief ADC_UNIT_1 - ON/OFF */
      (uint8)STD_OFF
            },
    {
          /**< @brief number of MHT groups of the ADC Hardware unit 0 */
      (uint8)0,
            /**< @brief number of MHT groups of the ADC Hardware unit 1 */
      (uint8)0
          }
    }
};

/* @violates @ref Adc_PBcfg_c_REF_4 Identifier exceeds 31 characters */
#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/* @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/* @violates @ref Adc_PBcfg_c_REF_2 Repeated include file */
#include "MemMap.h"

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/

#endif /* ADC_PRECOMPILE_SUPPORT */

#ifdef __cplusplus
}
#endif

/** @} */

